contest_de_seleccion_ioi_2022_c_producto_de_digitos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contest de seleccion IOI 2022: C. Producto de Digitos</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Contest de seleccion IOI 2022: C. Producto de Digitos</h1>
<p>
<a href="https://contest.yandex.ru/contest/38353/download/">Problem Statement</a>: Given integers \(n\) and \(b\), count how many integers \(x\) exists where \(1 \leq x \leq n\), \(x - P(x) = b\) and \(P(x)\) is the product of the digits of \(x\).
</p>

<p>
A straight forward observation is that \(x - P(x)\) is counted only for one possible \(b\).  In other words, its value does not depend on the input.  Is there any interesting property of \(x-P(x)\) that we can use to solve the problem?  Let's take a look on \(x - P(x)\) for \(0 \leq x \leq 30\) using the following snippet.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> <span style="font-weight: bold;">reduce</span>
<span style="font-weight: bold;">from</span> operator <span style="font-weight: bold;">import</span> mul

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">p</span>(n):
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">reduce</span>(mul, <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">str</span>(n)))

<span style="font-weight: bold;">return</span> (
    [(<span style="font-style: italic;">"x"</span>, <span style="font-style: italic;">"px"</span>, <span style="font-style: italic;">"x - p(x)"</span>)] +
    [(x, p(x), x - p(x)) <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(51)]
)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">x</td>
<td class="org-right">px</td>
<td class="org-right">x - p(x)</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">8</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">0</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">1</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">2</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">3</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">4</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">5</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">6</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">7</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">8</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">9</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-right">0</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-right">2</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-right">4</td>
<td class="org-right">18</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-right">6</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-right">8</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-right">10</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-right">12</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-right">14</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-right">16</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">29</td>
<td class="org-right">18</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-right">0</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-right">3</td>
<td class="org-right">28</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-right">6</td>
<td class="org-right">26</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-right">9</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-right">12</td>
<td class="org-right">22</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-right">15</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-right">18</td>
<td class="org-right">18</td>
</tr>

<tr>
<td class="org-right">37</td>
<td class="org-right">21</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-right">24</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-right">39</td>
<td class="org-right">27</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">40</td>
<td class="org-right">0</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-right">4</td>
<td class="org-right">37</td>
</tr>

<tr>
<td class="org-right">42</td>
<td class="org-right">8</td>
<td class="org-right">34</td>
</tr>

<tr>
<td class="org-right">43</td>
<td class="org-right">12</td>
<td class="org-right">31</td>
</tr>

<tr>
<td class="org-right">44</td>
<td class="org-right">16</td>
<td class="org-right">28</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-right">20</td>
<td class="org-right">25</td>
</tr>

<tr>
<td class="org-right">46</td>
<td class="org-right">24</td>
<td class="org-right">22</td>
</tr>

<tr>
<td class="org-right">47</td>
<td class="org-right">28</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-right">48</td>
<td class="org-right">32</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">49</td>
<td class="org-right">36</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-right">50</td>
<td class="org-right">0</td>
<td class="org-right">50</td>
</tr>
</tbody>
</table>

<p>
The result is 0 if \(x\) has only one digit or contains at least one digit 0.  The result is 10 if \(x\) has two digits.  Besides that, there are some repetitions as in \(x=49\) and \(x=27\) which means that for \(n=49\) and \(b=13\) we should return at least 2.  <a href="what_is_the_upper_lower_bound_for_the_expected_result.html#ID-326FB8B4-49C8-479C-960D-F0F50F11BDC9">What is the upper/lower bound for the expected result?</a>  This question is interesting because it the answer is <b>the output can be a very large number that we can't iterate to compute</b>, or <b>the output is computable number</b>.  The former implies that we have to find some sort of formula or an algorithm with logarithmic complexity, while the later means that there is a way to compute the answer in a reasonable way.  So, the question becomes: How many different \(x-P(x)\) exist?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> <span style="font-weight: bold;">reduce</span>, cache
<span style="font-weight: bold;">from</span> operator <span style="font-weight: bold;">import</span> mul

<span style="font-weight: bold; text-decoration: underline;">@cache</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">p</span>(n):
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">reduce</span>(mul, <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">str</span>(n)))

<span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>({x - p(x) <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(10**7)})
</pre>
</div>

<pre class="example">
6953658
</pre>


<p>
That is a big number which would require either a formula to compute or a logarithmic algorithm.  Looking to the results of \(x-P(x)\), the problem seems unlikely to be solved with a formula.  Why?  This \(P(x)\) depends on the digits of \(x\) and how would a close formula handle this property?  Wait.  What do we know about \(P(x)\)?  It is a number smaller than \(x\).  It can be the same for different \(x\), for example \(x=123\) or \(x=321\) has the same \(P(x)=6\).  How many different \(P(x)\) exist?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> <span style="font-weight: bold;">reduce</span>, cache
<span style="font-weight: bold;">from</span> operator <span style="font-weight: bold;">import</span> mul

<span style="font-weight: bold; text-decoration: underline;">@cache</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">p</span>(n):
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">reduce</span>(mul, <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">str</span>(n)))

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">count_p</span>(n):
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>({p(x) <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(n)})

<span style="font-weight: bold;">return</span> [
    (<span style="font-style: italic;">"interval"</span>, <span style="font-style: italic;">"# of distinct P(x)"</span>),
    (<span style="font-style: italic;">"$0...10^4$"</span>, count_p(10**4)),
    (<span style="font-style: italic;">"$0...10^5$"</span>, count_p(10**5)),
    (<span style="font-style: italic;">"$0...10^6$"</span>, count_p(10**6)),
    (<span style="font-style: italic;">"$0...10^7$"</span>, count_p(10**7)),
    (<span style="font-style: italic;">"$0...10^8$"</span>, count_p(10**8)),
]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">interval</td>
<td class="org-right"># of distinct P(x)</td>
</tr>

<tr>
<td class="org-left">\(0...10^4\)</td>
<td class="org-right">226</td>
</tr>

<tr>
<td class="org-left">\(0...10^5\)</td>
<td class="org-right">442</td>
</tr>

<tr>
<td class="org-left">\(0...10^6\)</td>
<td class="org-right">785</td>
</tr>

<tr>
<td class="org-left">\(0...10^7\)</td>
<td class="org-right">1297</td>
</tr>

<tr>
<td class="org-left">\(0...10^8\)</td>
<td class="org-right">2026</td>
</tr>
</tbody>
</table>


<p>
There are not many of them, but how could we generate them efficiently?  For that, we can use <a href="dynamic_programming_by_digit.html#ID-4EABECD0-AEDD-4A57-8902-67F2BC6673AC">Dynamic Programming by Digit</a> to go over all possible numbers \(x\) and compute \(P(x)\) of each one of them.  The function <code>rec</code> try all possible digits for the \(i\)th digit and returns all \(P(x)\) that could be generated so far.  With all possible \(P(x)\) generated, we can iterate over each one of them, say \(z\) and count those where \(z+b<n\) and \(p(z)=z+b\).  The first inequality comes from the fact that we can compute \(x\) knowing \(b\) and \(P(x)\), since \(x-P(x)=b\).  The second equation checks if the \(x\) derived from \(P(x)\) is a valid \(x\) one.
</p>

<p>
With \(k\) being the number of different values of \(P(x)\):
</p>
<ul class="org-ul">
<li>Time complexity: \(O(k)\)</li>
<li>Space complexity: \(O(k)\)</li>
</ul>
