notes/contest_de_seleccion_ioi_2022_c_producto_de_digitos.org
* Python solution

#+begin_src python
  from functools import cache, reduce
  from operator import mul


  def gen(n):
      digits = list(map(int, str(n)))

      @cache
      def rec(i, is_smaller, is_first_digit):
          if i == len(digits):
              return set([1] if not is_first_digit else [])

          ans = set()
          lim = 9 if is_smaller else digits[i]
          for k in range(lim + 1):
              for j in rec(
                  i + 1, is_smaller or (k < digits[i]), is_first_digit and k == 0
              ):
                  if is_first_digit and k == 0:
                      ans.add(j)
                  else:
                      ans.add(k * j)
          return ans

      return rec(0, False, True)


  def p(n):
      return reduce(mul, map(int, str(n)))


  def solve(n, b):
      ans = 0
      for px in gen(n):
          if b + px <= n and p(b + px) == px:
              ans += 1
      return ans


  assert solve(99999999999, 502) == 12
  assert solve(999, 434) == 2
  assert solve(255, 15) == 2
  assert solve(9999999999, 1) == 0
#+end_src

* C++ solution

#+begin_src C++
  #include <set>
  #include <vector>
  #include <cstdio>
  #include <algorithm>
  #include <string.h>
  #include <iostream>

  using namespace std;

  #define ll long long

  int vis[12][2][2];
  set<ll> memo[12][2][2];
  vector<int> digits;

  set<ll> gen(int i, int is_smaller, int is_first) {
    set<ll> ans;
    if (i == digits.size()) {
      if (!is_first) {
        ans.insert(1);
      }
      return ans;
    }
    if (vis[i][is_smaller][is_first]) {
      return memo[i][is_smaller][is_first];
    }

    int lim = is_smaller ? 9 : digits[i];
    for (int k = 0; k <= lim; k++) {
      set<ll> cur = gen(i + 1, is_smaller || (k < digits[i]), is_first && k == 0);
      for (set<ll>::iterator it = cur.begin(); it != cur.end(); it++) {
        ll j = *it;
        ans.insert(is_first && k == 0 ? j : k * j);
      }
    }
    memo[i][is_smaller][is_first] = ans;
    vis[i][is_smaller][is_first] = 1;
    return ans;
  }

  ll p(ll x) {
    if (x < 10) {
      return x;
    }
    int ans = 1;
    while (x > 0) {
      ans *= (x % 10);
      x = x / 10;
    }
    return ans;
  }

  vector<int> to_digits(ll n) {
    vector<int> digits;

    if (n < 10) {
      digits.push_back(n);
      return digits;
    }
    while (n > 0) {
      digits.push_back(n % 10);
      n = n / 10;
    }
    reverse(digits.begin(), digits.end());
    return digits;
  }

  int solve(ll n, ll b) {
    memset(vis, 0, sizeof(vis));
    digits = to_digits(n);

    set<ll> candidates = gen(0, 0, 1);

    int ans = 0;
    for (set<ll>::iterator it = candidates.begin(); it != candidates.end(); it++) {
      ll px = *it;
      ll x = b + px;
      if (x <= n && p(x) == px) {
        ans++;
      }
    }
    return ans;
  }

  int main() {

    assert(solve(99999999999, 502) == 12);
    assert(solve(999, 434) == 2);
    assert(solve(255, 15) == 2);
    assert(solve(9999999999, 1) == 0);

    ll n, b;
    cin >> n >> b;
    scanf("%lld %lld", &n, &b);
    to_digits(n);
    printf("%d\n", solve(n, b));

    return 0;
  }
#+end_src
