contest_de_seleccion_ioi_2022_c_producto_de_digitos.html

<div id="outline-container-orgba3c424" class="outline-2">
<h2 id="orgba3c424">Python solution</h2>
<div class="outline-text-2" id="text-orgba3c424">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> cache, <span style="font-weight: bold;">reduce</span>
<span style="font-weight: bold;">from</span> operator <span style="font-weight: bold;">import</span> mul


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">gen</span>(n):
    <span style="font-weight: bold; font-style: italic;">digits</span> = <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">str</span>(n)))

    <span style="font-weight: bold; text-decoration: underline;">@cache</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rec</span>(i, is_smaller, is_first_digit):
        <span style="font-weight: bold;">if</span> i == <span style="font-weight: bold;">len</span>(digits):
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">set</span>([1] <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> is_first_digit <span style="font-weight: bold;">else</span> [])

        ans = <span style="font-weight: bold;">set</span>()
        lim = 9 <span style="font-weight: bold;">if</span> is_smaller <span style="font-weight: bold;">else</span> digits[i]
        <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(lim + 1):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> rec(
                i + 1, is_smaller <span style="font-weight: bold;">or</span> (k &lt; digits[i]), is_first_digit <span style="font-weight: bold;">and</span> k == 0
            ):
                <span style="font-weight: bold;">if</span> is_first_digit <span style="font-weight: bold;">and</span> k == 0:
                    ans.add(j)
                <span style="font-weight: bold;">else</span>:
                    ans.add(k * j)
        <span style="font-weight: bold;">return</span> ans

    <span style="font-weight: bold;">return</span> rec(0, <span style="font-weight: bold; text-decoration: underline;">False</span>, <span style="font-weight: bold; text-decoration: underline;">True</span>)


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">p</span>(n):
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">reduce</span>(mul, <span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">str</span>(n)))


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">solve</span>(n, b):
    ans = 0
    <span style="font-weight: bold;">for</span> px <span style="font-weight: bold;">in</span> gen(n):
        <span style="font-weight: bold;">if</span> b + px &lt;= n <span style="font-weight: bold;">and</span> p(b + px) == px:
            ans += 1
    <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> solve(99999999999, 502) == 12
<span style="font-weight: bold;">assert</span> solve(999, 434) == 2
<span style="font-weight: bold;">assert</span> solve(255, 15) == 2
<span style="font-weight: bold;">assert</span> solve(9999999999, 1) == 0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa1186f" class="outline-2">
<h2 id="orgfa1186f">C++ solution</h2>
<div class="outline-text-2" id="text-orgfa1186f">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;set&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;vector&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;cstdio&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;algorithm&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;iostream&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;assert.h&gt;</span>

<span style="font-weight: bold;">using</span> <span style="font-weight: bold;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">std</span>;

<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">ll</span> <span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; text-decoration: underline;">long</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">vis</span>[12][2][2];
<span style="font-weight: bold; text-decoration: underline;">set</span>&lt;ll&gt; <span style="font-weight: bold; font-style: italic;">memo</span>[12][2][2];
<span style="font-weight: bold; text-decoration: underline;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>&gt; <span style="font-weight: bold; font-style: italic;">digits</span>;

<span style="font-weight: bold; text-decoration: underline;">set</span>&lt;ll&gt; <span style="font-weight: bold;">gen</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">is_smaller</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">is_first</span>) {
  <span style="font-weight: bold; text-decoration: underline;">set</span>&lt;ll&gt; <span style="font-weight: bold; font-style: italic;">ans</span>;
  <span style="font-weight: bold;">if</span> (i == digits.size()) {
    <span style="font-weight: bold;">if</span> (!is_first) {
      ans.insert(1);
    }
    <span style="font-weight: bold;">return</span> ans;
  }
  <span style="font-weight: bold;">if</span> (vis[i][is_smaller][is_first]) {
    <span style="font-weight: bold;">return</span> memo[i][is_smaller][is_first];
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">lim</span> = is_smaller ? 9 : digits[i];
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span> = 0; k &lt;= lim; k++) {
    <span style="font-weight: bold; text-decoration: underline;">set</span>&lt;ll&gt; <span style="font-weight: bold; font-style: italic;">cur</span> = gen(i + 1, is_smaller || (k &lt; digits[i]), is_first &amp;&amp; k == 0);
    <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">set</span>&lt;ll&gt;::<span style="font-weight: bold; text-decoration: underline;">iterator</span> <span style="font-weight: bold; font-style: italic;">it</span> = cur.begin(); it != cur.end(); it++) {
      <span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">j</span> = *it;
      ans.insert(is_first &amp;&amp; k == 0 ? j : k * j);
    }
  }
  memo[i][is_smaller][is_first] = ans;
  vis[i][is_smaller][is_first] = 1;
  <span style="font-weight: bold;">return</span> ans;
}

<span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold;">p</span>(<span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">x</span>) {
  <span style="font-weight: bold;">if</span> (x &lt; 10) {
    <span style="font-weight: bold;">return</span> x;
  }
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">ans</span> = 1;
  <span style="font-weight: bold;">while</span> (x &gt; 0) {
    ans *= (x % 10);
    x = x / 10;
  }
  <span style="font-weight: bold;">return</span> ans;
}

<span style="font-weight: bold; text-decoration: underline;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>&gt; <span style="font-weight: bold;">to_digits</span>(<span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">n</span>) {
  <span style="font-weight: bold; text-decoration: underline;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">int</span>&gt; <span style="font-weight: bold; font-style: italic;">digits</span>;

  <span style="font-weight: bold;">if</span> (n &lt; 10) {
    digits.push_back(n);
    <span style="font-weight: bold;">return</span> digits;
  }
  <span style="font-weight: bold;">while</span> (n &gt; 0) {
    digits.push_back(n % 10);
    n = n / 10;
  }
  reverse(digits.begin(), digits.end());
  <span style="font-weight: bold;">return</span> digits;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">solve</span>(<span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">n</span>, <span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">b</span>) {
  memset(vis, 0, <span style="font-weight: bold;">sizeof</span>(vis));
  digits = to_digits(n);

  <span style="font-weight: bold; text-decoration: underline;">set</span>&lt;<span style="font-weight: bold; text-decoration: underline;">ll</span>&gt; <span style="font-weight: bold; font-style: italic;">candidates</span> = gen(0, 0, 1);

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">ans</span> = 0;
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">set</span>&lt;<span style="font-weight: bold; text-decoration: underline;">ll</span>&gt;::<span style="font-weight: bold; text-decoration: underline;">iterator</span> <span style="font-weight: bold; font-style: italic;">it</span> = candidates.begin(); it != candidates.end(); it++) {
    <span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">px</span> = *it;
    <span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">x</span> = b + px;
    <span style="font-weight: bold;">if</span> (x &lt;= n &amp;&amp; p(x) == px) {
      ans++;
    }
  }
  <span style="font-weight: bold;">return</span> ans;
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {

  assert(solve(99999999999, 502) == 12);
  assert(solve(999, 434) == 2);
  assert(solve(255, 15) == 2);
  assert(solve(9999999999, 1) == 0);

  <span style="font-weight: bold; text-decoration: underline;">ll</span> <span style="font-weight: bold; font-style: italic;">n</span>, <span style="font-weight: bold; font-style: italic;">b</span>;
  scanf(<span style="font-style: italic;">"%lld %lld"</span>, &amp;n, &amp;b);
  to_digits(n);
  printf(<span style="font-style: italic;">"%d\n"</span>, solve(n, b));

  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>